# BuildingTypeName Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
HVACLoadBuildingType..::..BuildingTypeName Property
HVACLoadBuildingType Class See Also
---
The building type name.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2018
# Syntax
C#
---
```text
public string BuildingTypeName { get; set; }
```

Visual Basic
---
```text
Public Property BuildingTypeName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ BuildingTypeName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: name is an empty string or contains only whitespace. -or- When setting this property: name cannot include prohibited characters. -or- When setting this property: The given value for name is already in use as a building type name. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace